## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [ ]:
# Kelvin Waters
# Online FT 12/09/19 cohort
# Once submitted
# Rafael Carrasco

In [1]:
# import everything being used up top
from importlib import reload

import sqlite3
import pandas as pd
import numpy as np
import helper_functions as hf


import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns

In [2]:
reload(hf)

In [3]:
def preview_tables(conn, tables='all'):
    all_tables = hf.get_table_list(conn)
    if tables=='all':
        final_table_names = all_tables
        
    elif type(tables) == list:
        final_table_names = [t for t in all_tables if t in tables]
    
    for table_name in final_table_names:
        print(f"Showing Table: {table_name}")
        query = f"select * from {table_name};"
        df = pd.read_sql(query, conn)
        display(df.head(2))
        print("-"*100)
    print("finished")
    return None

In [4]:
conn = sqlite3.Connection("movies_db.sqlite")
c = conn.cursor()

In [5]:
table_names = hf.get_table_list(conn)
table_names

['bom_movie_gross',
 'name_basics',
 'title_akas',
 'title_basics',
 'title_crew',
 'title_principals',
 'title_ratings',
 'tmdb_movies',
 'tn_movie_budgets']

In [6]:
preview_tables(conn, tables= 'all')

Showing Table: bom_movie_gross

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

----------------------------------------------------------------------------------------------------
Showing Table: name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

----------------------------------------------------------------------------------------------------
Showing Table: title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0

----------------------------------------------------------------------------------------------------
Showing Table: title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

----------------------------------------------------------------------------------------------------
Showing Table: title_crew

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973       None  nm0175726,nm1802864

----------------------------------------------------------------------------------------------------
Showing Table: title_principals

      tconst  ordering     nconst  category   job   characters
0  tt0111414         1  nm0246005     actor  None  ["The Man"]
1  tt0111414         2  nm0398271  director  None         None

----------------------------------------------------------------------------------------------------
Showing Table: title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

----------------------------------------------------------------------------------------------------
Showing Table: tmdb_movies

,index,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

----------------------------------------------------------------------------------------------------
Showing Table: tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

----------------------------------------------------------------------------------------------------
finished

# Top 5 domestic profitable studios

# bom_movie_gross

In [7]:
# initial table data
bm = hf.load_table(conn, "bom_movie_gross")
bm.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [8]:
bm.shape

(3387, 5)

In [9]:
# studio count
bm.groupby('studio')['studio'].agg('count')

studio
3D        1
A23       2
A24      49
ADC       2
AF        6
         ..
XL        2
YFG       1
Yash     14
Zee       1
Zeit.    16
Name: studio, Length: 257, dtype: int64

In [10]:
# dropping NaN's from domestic_gross and the 5 missing studio values
# title                0
# studio               5
# domestic_gross      28
# foreign_gross     1350
# year                 0
bm1 = bm.dropna()
bm1.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [11]:
# dropping foreign gross from table > 30% NaN
# dropped year, time not a factor
bm2 = bm1.drop(['foreign_gross', 'year'], axis='columns')

In [12]:
bm2

,title,studio,domestic_gross
0,Toy Story 3,BV,415000000.0
1,Alice in Wonderland (2010),BV,334200000.0
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0
3,Inception,WB,292600000.0
4,Shrek Forever After,P/DW,238700000.0
...,...,...,...
3275,I Still See You,LGF,1400.0
3286,The Catcher Was a Spy,IFC,725000.0
3309,Time Freak,Grindstone,10000.0
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0

In [13]:
# bm3 = bm2.groupby('studio')['domestic_gross'].agg('sum').sort_values(ascending= False)
# bm3.head()

# tmdb_movies

In [14]:
tm = hf.load_table(conn, "tmdb_movies")
tm.head()

,index,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [15]:
tm.shape

(26517, 10)

In [16]:
tm.isna().sum()

index                0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [17]:
tm1 = tm.drop(['index', 'original_language', 'release_date'], axis='columns')

In [18]:
tm1.head()

,genre_ids,id,original_title,popularity,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,Harry Potter and the Deathly Hallows: Part 1,33.533,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,How to Train Your Dragon,28.734,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,Iron Man 2,28.515,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,Toy Story,28.005,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,Inception,27.920,Inception,8.3,22186

# tn_movie_budgets

In [19]:
tn = hf.load_table(conn, "tn_movie_budgets")

In [20]:
money_cols = ['production_budget', 'domestic_gross', 'worldwide_gross']

for col in money_cols:
    tn = hf.convert_dollars_to_int(tn, col)

In [21]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [22]:
tn.shape

(5782, 6)

In [23]:
tn.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [24]:
tn1 = tn.drop(['release_date'], axis='columns')

In [25]:
tn1.head()

,id,movie,production_budget,domestic_gross,worldwide_gross
0,1,Avatar,425000000,760507625,2776345279
1,2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,Dark Phoenix,350000000,42762350,149762350
3,4,Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [26]:
tn1['profit'] = tn1['worldwide_gross']+tn1['domestic_gross'] - tn1['production_budget']

In [27]:
tn1.head()

,id,movie,production_budget,domestic_gross,worldwide_gross,profit
0,1,Avatar,425000000,760507625,2776345279,3111852904
1,2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,876127750
2,3,Dark Phoenix,350000000,42762350,149762350,-157475300
3,4,Avengers: Age of Ultron,330600000,459005868,1403013963,1531419831
4,5,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,1619903129

In [47]:
tn2 = tn1.rename(columns={'movie': 'title'})
tn2.head()

,id,title,production_budget,domestic_gross,worldwide_gross,profit
0,1,Avatar,425000000,760507625,2776345279,3111852904
1,2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,876127750
2,3,Dark Phoenix,350000000,42762350,149762350,-157475300
3,4,Avengers: Age of Ultron,330600000,459005868,1403013963,1531419831
4,5,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,1619903129

# title_basics

In [29]:
tb = hf.load_table(conn, "title_basics")
tb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [30]:
tb.shape

(146144, 6)

In [31]:
tb.isna().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [32]:
tb1 = tb.drop(['original_title', 'start_year', 'runtime_minutes'], axis='columns')

In [33]:
tb1.head()

      tconst                    primary_title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

# title_ratings

In [34]:
tr = hf.load_table(conn, "title_ratings")
tr.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [35]:
tr.shape

(73856, 3)

In [36]:
tr.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [37]:
# renaming col
tr.rename(columns={'averagerating': 'average_rating'}, inplace= True)

In [38]:
tr.head()

       tconst  average_rating  numvotes
0  tt10356526             8.3        31
1  tt10384606             8.9       559
2   tt1042974             6.4        20
3   tt1043726             4.2     50352
4   tt1060240             6.5        21

In [39]:
tr['numvotes'].describe()

count    7.385600e+04
mean     3.523662e+03
std      3.029402e+04
min      5.000000e+00
25%      1.400000e+01
50%      4.900000e+01
75%      2.820000e+02
max      1.841066e+06
Name: numvotes, dtype: float64

# Merging DataFrames

In [40]:
# merge between tables title_basics, title_ratings
tb1_tr_merge = pd.merge(tb1, tr, on ='tconst')
tb1_tr_merge

,tconst,primary_title,genres,average_rating,numvotes
0,tt0063540,Sunghursh,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,"Comedy,Drama,Fantasy",6.5,119
...,...,...,...,...,...
73851,tt9913084,Diabolik sono io,Documentary,6.2,6
73852,tt9914286,Sokagin Çocuklari,"Drama,Family",8.7,136
73853,tt9914642,Albatross,Documentary,8.5,8
73854,tt9914942,La vida sense la Sara Amat,None,6.6,5
73855,tt9916160,Drømmeland,Documentary,6.5,11

In [44]:
# merge between tables tmdb_movies, bom_movie_gross
tm1_bm2_merge = pd.merge(tm1, bm2, on = 'title')
tm1_bm2_merge

,genre_ids,id,original_title,popularity,title,vote_average,vote_count,studio,domestic_gross
0,"[14, 12, 16, 10751]",10191,How to Train Your Dragon,28.734,How to Train Your Dragon,7.7,7610,P/DW,217600000.0
1,"[12, 28, 878]",10138,Iron Man 2,28.515,Iron Man 2,6.8,12368,Par.,312400000.0
2,"[28, 878, 12]",27205,Inception,27.920,Inception,8.3,22186,WB,292600000.0
3,"[16, 10751, 35]",10193,Toy Story 3,24.445,Toy Story 3,7.7,8340,BV,415000000.0
4,"[16, 10751, 35]",20352,Despicable Me,23.673,Despicable Me,7.2,10057,Uni.,251500000.0
...,...,...,...,...,...,...,...,...,...
1696,"[12, 80, 10751, 35]",425148,Show Dogs,7.904,Show Dogs,5.9,92,Global Road,17900000.0
1697,"[35, 10749, 18, 9648]",522921,超时空同居,6.840,How Long Will I Love U,7.4,11,WGUSA,747000.0
1698,"[12, 35, 14]",497984,捉妖记2,6.637,Monster Hunt 2,6.3,14,LGF,706000.0
1699,"[18, 10749]",446132,Gauguin: Voyage de Tahiti,5.553,Gauguin: Voyage to Tahiti,5.6,48,Cohen,200000.0
1700,"[28, 12, 16]",332718,Bilal: A New Breed of Hero,2.707,Bilal: A New Breed of Hero,6.8,54,VE,491000.0

In [48]:
merged_df = pd.merge(tm1_bm2_merge, tn2, on = 'title')
merged_df

,genre_ids,id_x,original_title,popularity,title,vote_average,vote_count,studio,domestic_gross_x,id_y,production_budget,domestic_gross_y,worldwide_gross,profit
0,"[14, 12, 16, 10751]",10191,How to Train Your Dragon,28.734,How to Train Your Dragon,7.7,7610,P/DW,217600000.0,30,165000000,217581232,494870992,547452224
1,"[12, 28, 878]",10138,Iron Man 2,28.515,Iron Man 2,6.8,12368,Par.,312400000.0,15,170000000,312433331,621156389,763589720
2,"[28, 878, 12]",27205,Inception,27.920,Inception,8.3,22186,WB,292600000.0,38,160000000,292576195,835524642,968100837
3,"[16, 10751, 35]",10193,Toy Story 3,24.445,Toy Story 3,7.7,8340,BV,415000000.0,47,200000000,415004880,1068879522,1283884402
4,"[16, 10751, 35]",20352,Despicable Me,23.673,Despicable Me,7.2,10057,Uni.,251500000.0,50,69000000,251513985,543464573,725978558
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1192,[36],476968,"Paul, Apostle of Christ",12.005,"Paul, Apostle of Christ",7.1,98,Affirm,17600000.0,95,5000000,17547999,25529498,38077497
1193,"[18, 36, 53]",453201,The 15:17 to Paris,11.576,The 15:17 to Paris,5.3,799,WB,36300000.0,23,30000000,36276286,56096200,62372486
1194,[35],474335,Uncle Drew,10.836,Uncle Drew,6.5,220,LG/S,42500000.0,85,18000000,42469946,46527161,70997107
1195,"[53, 28, 80]",442064,Proud Mary,9.371,Proud Mary,5.5,259,SGem,20900000.0,50,30000000,20868638,21709539,12578177
1196,"[28, 12, 16]",332718,Bilal: A New Breed of Hero,2.707,Bilal: A New Breed of Hero,6.8,54,VE,491000.0,100,30000000,490973,648599,-28860428

In [50]:
merged_df.columns

Index(['genre_ids', 'id_x', 'original_title', 'popularity', 'title',
       'vote_average', 'vote_count', 'studio', 'domestic_gross_x', 'id_y',
       'production_budget', 'domestic_gross_y', 'worldwide_gross', 'profit'],
      dtype='object')

## REWORK ABOVE!!!  REWORK ABOVE!!!  REWORK ABOVE!!!  REWORK ABOVE!!! ##

In [ ]:
# WORKING CELL
# (3387, 5)
# title              object
# studio             object
# domestic_gross    float64
# foreign_gross      object
# year                int64
# title                0
# studio               5
# domestic_gross      28
# foreign_gross     1350
# year                 0

bom_movie_gross_df = hf.load_table(conn, "bom_movie_gross")
bom_movie_gross_df.foreign_gross.describe()

In [ ]:
# foriegn values on this table exceed 30 percent
# will have to find other data to add that information for each studio
# that's global.
# values too large for plotting
# both of the values I need are on the same table
c.execute("""SELECT title, 
        studio, 
        SUM(domestic_gross)
        FROM bom_movie_gross
        GROUP BY studio
        ORDER BY SUM(domestic_gross) DESC
        """)
bom_movie_gross_df = pd.DataFrame(c.fetchall())
bom_movie_gross_df.columns = [x[0] for x in c.description]
bom_movie_gross_df.head()

In [ ]:
bom_movie_gross_df.rename(columns = {'SUM(domestic_gross)':'domestic gross'}, inplace= True)

In [ ]:
top_5 = bom_movie_gross_df.head()
top_5

In [ ]:
top_5.plot.bar(x='studio', y='domestic gross')
plt.title('Top Producing Studios')
plt.xlabel('Studio')
plt.ylabel('Billions Yo!')
plt.grid(True)
ax = fig.add_subplot(111)
ax.plot(x, y, color='lightblue', linewidth= 3)

In [ ]:
sns.barplot(x='studio', y='domestic gross', )

In [ ]:
# need to get a subset through a filter
# to depict a more relatable graph
topfive = bom_movie_gross_df.head().describe()
topfive.plot(kind='bar')
# Turn on the grid
plt.minorticks_on()
plt.grid(which='major', linestyle='-', linewidth='0.5', color='green')
plt.grid(which='minor', linestyle=':', linewidth='0.5', color='black')

plt.show()

In [ ]:
# domestic_gross boxplot
# outliars hard to indentify with matplotlib and the large values in 
# this column will have to filter and use a subset at the prospect of 
# sacrificing some data loss
bom_movie_gross_df.head().plot(kind='box')

In [ ]:
# line plotting is to show some value over time/duration not a 
# valid option for what I'm attempting to achieve since the data
# isn't time sensitive.
# these values are too large need to find a way to get a subset
# where the marjority of the values reside without sacrificing data

bom_movie_gross_df.head().plot(kind='barh', stacked=True)
bom_movie_gross_df.head().plot(kind='bar', stacked=True)
plt.show()

# Adverage rating, numvotes, and genres

In [ ]:
# WORKING CELL
# Original table data
# (73856, 3)
# tconst            object
# averagerating    float64
# numvotes           int64
# tconst           0
# averagerating    0
# numvotes         0

title_ratings_df = hf.load_table(conn, "title_ratings")

In [ ]:
# rename col averagerating 
title_ratings_df.rename(columns={'averagerating': 'average_rating'}, inplace= True)
title_ratings_df.head()

In [ ]:
title_ratings_df.groupby('average_rating').numvotes.mean().sort_values().head()

In [ ]:
# the majority of numvotes are below 1000
# filtering this distribution will lose some data have to check the 
# shape to make that determination but the graph looks more relatable

# title_ratings_df[title_ratings_df.numvotes < 5000].numvotes.plot(kind='hist')
# title_ratings_df.query('numvotes < 5000').numvotes.plot(kind= 'hist')
# loc can be passed a multiple cols a range of cols so is probably a better choice.
title_ratings_df.loc[title_ratings_df.numvotes < 1500, 'numvotes'].plot(kind='hist')

In [ ]:
# WORKING CELL
# Original table data
# (146144, 6)
# tconst              object
# primary_title       object
# original_title      object
# start_year           int64
# runtime_minutes    float64
# genres              object
# tconst                 0
# primary_title          0
# original_title        21
# start_year             0
# runtime_minutes    31739
# genres              5408

title_basics_df = hf.load_table(conn, "title_basics")
title_basics_df.genres.str.contains('Horror').values_counts()

In [ ]:
# bar is best for category data
# reversed axis?! something to do with how pandas reads row order
# I don't know how to sort data before plotting
title_basics_df.start_year.value_counts().sort_index().plot()

# getting the data

In [ ]:
# obtaining the data i'm looking for
c.execute("""SELECT tconst,
        averagerating,
        numvotes
        FROM title_ratings
        """)
title_ratings_df = pd.DataFrame(c.fetchall())
title_ratings_df.columns = [x[0] for x in c.description]
title_ratings_df.head()

In [ ]:
# rename col averagerating 
title_ratings_df.rename(columns={'averagerating': 'average_rating'}, inplace= True)
title_ratings_df.head()

In [ ]:
# obtaining the data I'm looking for
c.execute("""SELECT tconst,
        primary_title,
        genres
        FROM title_basics
        """)
title_basics_df = pd.DataFrame(c.fetchall())
title_basics_df.columns = [x[0] for x in c.description]
title_basics_df.head()

In [ ]:
# RangeIndex: 146144 entries, 0 to 146143
# Data columns (total 3 columns):
# tconst           146144 non-null object
# primary_title    146144 non-null object
# genres           140736 non-null object
# dtypes: object(3)
# tconst                 0
# primary_title          0
# runtime_minutes    31739
# genres              5408
title_basics_df.info()

In [ ]:
merged_titles = pd.merge(title_basics_df, title_ratings_df, on ='tconst')
merged_titles.head()

In [ ]:
merged_titles.groupby('genres').numvotes.mean().head()

In [ ]:
# this is very skewed towards vumvotes values
mt = merged_titles.head().mean()
mt.plot(kind='bar')
# Turn on the grid
plt.minorticks_on()
plt.grid(which='major', linestyle='-', linewidth='0.5', color='green')
plt.grid(which='minor', linestyle=':', linewidth='0.5', color='black')

plt.show()

# Question # 3 popularity & domestic gross

In [ ]:
# show the value and/ or correalation of movie popularity 
# and profitability, attempt to tie this back to the studio
# that owns this production
# Original table data
# (5782, 6)
# id                    int64
# release_date         object
# movie                object
# production_budget    object
# domestic_gross       object
# worldwide_gross      object
# id                   0
# release_date         0
# movie                0
# production_budget    0
# domestic_gross       0
# worldwide_gross      0

tn_movie_budgets_df = hf.load_table(conn, "tn_movie_budgets")
tn_movie_budgets_df.isna().sum()

In [ ]:
# Original table data
# (26517, 10)
# index                  int64
# genre_ids             object
# id                     int64
# original_language     object
# original_title        object
# popularity           float64
# release_date          object
# title                 object
# vote_average         float64
# vote_count             int64
# index                0
# genre_ids            0
# id                   0
# original_language    0
# original_title       0
# popularity           0
# release_date         0
# title                0
# vote_average         0
# vote_count           0

tmdb_movies_df = hf.load_table(conn, "tmdb_movies")
tmdb_movies_df.isna().sum()

In [ ]:
# convert to int64 helper function
tn_movie_budgets_df = hf.load_table(conn, "tn_movie_budgets")

In [ ]:
# convert dollars to integers
money_cols = ['production_budget', 'domestic_gross', 'worldwide_gross']

for col in money_cols:
    tn_movie_budgets_df = hf.convert_dollars_to_int(tn_movie_budgets_df, col)

In [ ]:
# c.execute("""SELECT id,
#         movie,
#         production_budget,
#         domestic_gross,
#         worldwide_gross
#         FROM tn_movie_budgets
#         """)
# tn_movie_budgets_df = pd.DataFrame(c.fetchall())
# tn_movie_budgets_df.columns = [x[0] for x in c.description]
tn_movie_budgets_df.head()

In [ ]:
c.execute("""SELECT release_date,
        popularity,
        vote_average,
        vote_count
        FROM tmdb_movies
        """)
tmdb_movies_df = pd.DataFrame(c.fetchall())
tmdb_movies_df.columns = [x[0] for x in c.description]
tmdb_movies_df.head()

In [ ]:
tmdb_movies_df.groupby('popularity').vote_count.mean().sort_values().head()

# merging tables

In [ ]:
# to_concast abandoned, recommended join, found merge works even better 
# thus far, only took a day!
merged_tn_tmdb = pd.merge(tn_movie_budgets_df, tmdb_movies_df, on ='release_date')
merged_tn_tmdb.head()